---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionColored
source: html/588e57a7-b43e-50f0-47ba-11154cae9a24.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionColored

A stream that can be used to write vertices of type VertexPositionColored
 into a buffer (see VertexBuffer ).

## Syntax (C#)
```csharp
public class VertexStreamPositionColored : VertexStream
```